Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0256GPG048.atdf
      <value-group caption="AN20 Signed Data Mode bit" name="ADCIMCON2__SIGN20">
         <value caption="AN20 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN20 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN20 Mode bit" name="ADCIMCON2__DIFF20">
         <value caption="Selects AN20 differential pair input as AN20+ and AN1-" name="" value="0x1" />
         <value caption="AN20 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN21 Signed Data Mode bit" name="ADCIMCON2__SIGN21">
         <value caption="AN21 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN21 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN21 Mode bit" name="ADCIMCON2__DIFF21">
         <value caption="Selects AN21 differential pair input as AN21+ and AN1-" name="" value="0x1" />
         <value caption="AN21 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN22 Signed Data Mode bit" name="ADCIMCON2__SIGN22">
         <value caption="AN22 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN22 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN22 Mode bit" name="ADCIMCON2__DIFF22">
         <value caption="Selects AN22 differential pair input as AN22+ and AN1-" name="" value="0x1" />
         <value caption="AN22 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN23 Signed Data Mode bit" name="ADCIMCON2__SIGN23">
         <value caption="AN23 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN23 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN23 Mode bit" name="ADCIMCON2__DIFF23">
         <value caption="Selects AN23 differential pair input as AN23+ and AN1-" name="" value="0x1" />
         <value caption="AN23 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN24 Signed Data Mode bit" name="ADCIMCON2__SIGN24">
         <value caption="AN24 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN24 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN24 Mode bit" name="ADCIMCON2__DIFF24">
         <value caption="Selects AN24 differential pair input as AN24+ and AN1-" name="" value="0x1" />
         <value caption="AN24 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN25 Signed Data Mode bit" name="ADCIMCON2__SIGN25">
         <value caption="AN25 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN25 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN25 Mode bit" name="ADCIMCON2__DIFF25">
         <value caption="Selects AN25 differential pair input as AN25+ and AN1-" name="" value="0x1" />
         <value caption="AN25 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN26 Signed Data Mode bit" name="ADCIMCON2__SIGN26">
         <value caption="AN26 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN26 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN26 Mode bit" name="ADCIMCON2__DIFF26">
         <value caption="Selects AN26 differential pair input as AN26+ and AN1-" name="" value="0x1" />
         <value caption="AN26 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN27 Signed Data Mode bit" name="ADCIMCON2__SIGN27">
         <value caption="AN27 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN27 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN27 Mode bit" name="ADCIMCON2__DIFF27">
         <value caption="Selects AN27 differential pair input as AN27+ and AN1-" name="" value="0x1" />
         <value caption="AN27 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN33 Signed Data Mode bit" name="ADCIMCON3__SIGN33">
         <value caption="AN33 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN33 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN33 Mode bit" name="ADCIMCON3__DIFF33">
         <value caption="Selects AN33 differential input pair as AN33+ and AN1-" name="" value="0x1" />
         <value caption="AN33 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN34 Signed Data Mode bit" name="ADCIMCON3__SIGN34">
         <value caption="AN34 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN34 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN34 Mode bit" name="ADCIMCON3__DIFF34">
         <value caption="Selects AN34 differential input pair as AN34+ and AN1-" name="" value="0x1" />
         <value caption="AN34 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN35 Signed Data Mode bit" name="ADCIMCON3__SIGN35">
         <value caption="AN35 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN35 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN35 Mode bit" name="ADCIMCON3__DIFF35">
         <value caption="Selects AN35 differential input pair as AN35+ and AN1-" name="" value="0x1" />
         <value caption="AN35 is using Single-ended mode" name="" value="0x0" />
      </value-group>
      <value-group caption="AN36 Signed Data Mode bit" name="ADCIMCON3__SIGN36">
         <value caption="AN36 is using Signed Data mode" name="" value="0x1" />
         <value caption="AN36 is using Unsigned Data mode" name="" value="0x0" />
      </value-group>
