Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0256GPG048.atdf
      <value-group caption="Gate 1 Data Source 1 Negated Enable bit" name="CLC4GLS__G1D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 1 True Enable bit" name="CLC4GLS__G1D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 Negated Enable bit" name="CLC4GLS__G1D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 True Enable bit" name="CLC4GLS__G1D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 Negated Enable bit" name="CLC4GLS__G1D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 True Enable bit" name="CLC4GLS__G1D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 Negated Enable bit" name="CLC4GLS__G1D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 True Enable bit" name="CLC4GLS__G1D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 1 Negated Enable bit" name="CLC4GLS__G2D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 1 True Enable bit" name="CLC4GLS__G2D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 2 Negated Enable bit" name="CLC4GLS__G2D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 2 True Enable bit" name="CLC4GLS__G2D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 3 Negated Enable bit" name="CLC4GLS__G2D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 3 True Enable bit" name="CLC4GLS__G2D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 4 Negated Enable bit" name="CLC4GLS__G2D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 2 Data Source 4 True Enable bit" name="CLC4GLS__G2D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 2" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 2" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 1 Negated Enable bit" name="CLC4GLS__G3D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 1 True Enable bit" name="CLC4GLS__G3D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 2 Negated Enable bit" name="CLC4GLS__G3D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 2 True Enable bit" name="CLC4GLS__G3D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 3 Negated Enable bit" name="CLC4GLS__G3D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 3 True Enable bit" name="CLC4GLS__G3D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 4 Negated Enable bit" name="CLC4GLS__G3D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 3 Data Source 4 True Enable bit" name="CLC4GLS__G3D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 3" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 3" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 1 Negated Enable bit" name="CLC4GLS__G4D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 1 True Enable bit" name="CLC4GLS__G4D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 2 Negated Enable bit" name="CLC4GLS__G4D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 2 True Enable bit" name="CLC4GLS__G4D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 3 Negated Enable bit" name="CLC4GLS__G4D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 3 True Enable bit" name="CLC4GLS__G4D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 4 Negated Enable bit" name="CLC4GLS__G4D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 4 Data Source 4 True Enable bit" name="CLC4GLS__G4D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 4" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 4" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01427" name="CMP" version="">
      <register-group name="CMP">
         <register caption="Op amp/Comparator Status Register" name="CMSTAT" offset="0x0" rw="RW" size="4">
            <bitfield caption="Op amp/Comparator 1 Output Status bit" mask="0x00000001" name="C1OUT" values="CMSTAT__C1OUT" />
            <bitfield caption="Op amp/Comparator 2 Output Status bit" mask="0x00000002" name="C2OUT" values="CMSTAT__C2OUT" />
            <bitfield caption="Op amp/Comparator 3 Output Status bit" mask="0x00000004" name="C3OUT" values="CMSTAT__C3OUT" />
            <bitfield caption="Op amp/Comparator 4 Output Status bit" mask="0x00000008" name="C4OUT" values="CMSTAT__C4OUT" />
            <bitfield caption="Op amp/Comparator 5 Output Status bit" mask="0x00000010" name="C5OUT" values="CMSTAT__C5OUT" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="CMSTAT__SIDL" />
            <bitfield caption="Comparator 1 Event Status bit" mask="0x00010000" name="C1EVT" values="CMSTAT__C1EVT" />
            <bitfield caption="Comparator 2 Event Status bit" mask="0x00020000" name="C2EVT" values="CMSTAT__C2EVT" />
            <bitfield caption="Comparator 3 Event Status bit" mask="0x00040000" name="C3EVT" values="CMSTAT__C3EVT" />
            <bitfield caption="Comparator 4 Event Status bit" mask="0x00080000" name="C4EVT" values="CMSTAT__C4EVT" />
            <bitfield caption="Comparator 5 Event Status bit" mask="0x00100000" name="C5EVT" values="CMSTAT__C5EVT" />
         </register>
