Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0256GPG048.atdf
         <register caption="" name="TRISA" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISA" />
            <bitfield mask="0x00000002" name="TRISA" />
            <bitfield mask="0x00000004" name="TRISA" />
            <bitfield mask="0x00000008" name="TRISA" />
            <bitfield mask="0x00000010" name="TRISA" />
            <bitfield mask="0x00000020" name="TRISA" />
            <bitfield mask="0x00000040" name="TRISA" />
            <bitfield mask="0x00000080" name="TRISA" />
            <bitfield mask="0x00000100" name="TRISA" />
            <bitfield mask="0x00000200" name="TRISA" />
            <bitfield mask="0x00000400" name="TRISA" />
            <bitfield mask="0x00000800" name="TRISA" />
            <bitfield mask="0x00001000" name="TRISA" />
            <bitfield mask="0x00002000" name="TRISA" />
            <bitfield mask="0x00004000" name="TRISA" />
            <bitfield mask="0x00008000" name="TRISA" />
         </register>
         <register caption="" name="TRISB" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISB" />
            <bitfield mask="0x00000002" name="TRISB" />
            <bitfield mask="0x00000004" name="TRISB" />
            <bitfield mask="0x00000008" name="TRISB" />
            <bitfield mask="0x00000010" name="TRISB" />
            <bitfield mask="0x00000020" name="TRISB" />
            <bitfield mask="0x00000040" name="TRISB" />
            <bitfield mask="0x00000080" name="TRISB" />
            <bitfield mask="0x00000100" name="TRISB" />
            <bitfield mask="0x00000200" name="TRISB" />
            <bitfield mask="0x00000400" name="TRISB" />
            <bitfield mask="0x00000800" name="TRISB" />
            <bitfield mask="0x00001000" name="TRISB" />
            <bitfield mask="0x00002000" name="TRISB" />
            <bitfield mask="0x00004000" name="TRISB" />
            <bitfield mask="0x00008000" name="TRISB" />
         </register>
         <register caption="" name="TRISC" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISC" />
            <bitfield mask="0x00000002" name="TRISC" />
            <bitfield mask="0x00000004" name="TRISC" />
            <bitfield mask="0x00000008" name="TRISC" />
            <bitfield mask="0x00000010" name="TRISC" />
            <bitfield mask="0x00000020" name="TRISC" />
            <bitfield mask="0x00000040" name="TRISC" />
            <bitfield mask="0x00000080" name="TRISC" />
            <bitfield mask="0x00000100" name="TRISC" />
            <bitfield mask="0x00000200" name="TRISC" />
            <bitfield mask="0x00000400" name="TRISC" />
            <bitfield mask="0x00000800" name="TRISC" />
            <bitfield mask="0x00001000" name="TRISC" />
            <bitfield mask="0x00002000" name="TRISC" />
            <bitfield mask="0x00004000" name="TRISC" />
            <bitfield mask="0x00008000" name="TRISC" />
         </register>
         <register caption="" name="TRISD" offset="0x310" rw="RW" size="4">
            <bitfield mask="0x00000001" name="TRISD" />
            <bitfield mask="0x00000002" name="TRISD" />
            <bitfield mask="0x00000004" name="TRISD" />
            <bitfield mask="0x00000008" name="TRISD" />
            <bitfield mask="0x00000010" name="TRISD" />
            <bitfield mask="0x00000020" name="TRISD" />
            <bitfield mask="0x00000040" name="TRISD" />
            <bitfield mask="0x00000080" name="TRISD" />
            <bitfield mask="0x00000100" name="TRISD" />
            <bitfield mask="0x00000200" name="TRISD" />
            <bitfield mask="0x00000400" name="TRISD" />
            <bitfield mask="0x00000800" name="TRISD" />
            <bitfield mask="0x00001000" name="TRISD" />
            <bitfield mask="0x00002000" name="TRISD" />
            <bitfield mask="0x00004000" name="TRISD" />
            <bitfield mask="0x00008000" name="TRISD" />
         </register>
         <register caption="" name="PORTA" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTA" />
            <bitfield mask="0x00000002" name="PORTA" />
            <bitfield mask="0x00000004" name="PORTA" />
            <bitfield mask="0x00000008" name="PORTA" />
            <bitfield mask="0x00000010" name="PORTA" />
            <bitfield mask="0x00000020" name="PORTA" />
            <bitfield mask="0x00000040" name="PORTA" />
            <bitfield mask="0x00000080" name="PORTA" />
            <bitfield mask="0x00000100" name="PORTA" />
            <bitfield mask="0x00000200" name="PORTA" />
            <bitfield mask="0x00000400" name="PORTA" />
            <bitfield mask="0x00000800" name="PORTA" />
            <bitfield mask="0x00001000" name="PORTA" />
            <bitfield mask="0x00002000" name="PORTA" />
            <bitfield mask="0x00004000" name="PORTA" />
            <bitfield mask="0x00008000" name="PORTA" />
         </register>
         <register caption="" name="PORTB" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTB" />
            <bitfield mask="0x00000002" name="PORTB" />
            <bitfield mask="0x00000004" name="PORTB" />
            <bitfield mask="0x00000008" name="PORTB" />
            <bitfield mask="0x00000010" name="PORTB" />
            <bitfield mask="0x00000020" name="PORTB" />
            <bitfield mask="0x00000040" name="PORTB" />
            <bitfield mask="0x00000080" name="PORTB" />
            <bitfield mask="0x00000100" name="PORTB" />
            <bitfield mask="0x00000200" name="PORTB" />
            <bitfield mask="0x00000400" name="PORTB" />
            <bitfield mask="0x00000800" name="PORTB" />
            <bitfield mask="0x00001000" name="PORTB" />
            <bitfield mask="0x00002000" name="PORTB" />
            <bitfield mask="0x00004000" name="PORTB" />
            <bitfield mask="0x00008000" name="PORTB" />
         </register>
         <register caption="" name="PORTC" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTC" />
            <bitfield mask="0x00000002" name="PORTC" />
            <bitfield mask="0x00000004" name="PORTC" />
            <bitfield mask="0x00000008" name="PORTC" />
            <bitfield mask="0x00000010" name="PORTC" />
            <bitfield mask="0x00000020" name="PORTC" />
            <bitfield mask="0x00000040" name="PORTC" />
            <bitfield mask="0x00000080" name="PORTC" />
            <bitfield mask="0x00000100" name="PORTC" />
            <bitfield mask="0x00000200" name="PORTC" />
            <bitfield mask="0x00000400" name="PORTC" />
            <bitfield mask="0x00000800" name="PORTC" />
            <bitfield mask="0x00001000" name="PORTC" />
            <bitfield mask="0x00002000" name="PORTC" />
            <bitfield mask="0x00004000" name="PORTC" />
            <bitfield mask="0x00008000" name="PORTC" />
         </register>
         <register caption="" name="PORTD" offset="0x320" rw="RW" size="4">
            <bitfield mask="0x00000001" name="PORTD" />
            <bitfield mask="0x00000002" name="PORTD" />
            <bitfield mask="0x00000004" name="PORTD" />
            <bitfield mask="0x00000008" name="PORTD" />
            <bitfield mask="0x00000010" name="PORTD" />
            <bitfield mask="0x00000020" name="PORTD" />
            <bitfield mask="0x00000040" name="PORTD" />
            <bitfield mask="0x00000080" name="PORTD" />
            <bitfield mask="0x00000100" name="PORTD" />
            <bitfield mask="0x00000200" name="PORTD" />
            <bitfield mask="0x00000400" name="PORTD" />
            <bitfield mask="0x00000800" name="PORTD" />
            <bitfield mask="0x00001000" name="PORTD" />
            <bitfield mask="0x00002000" name="PORTD" />
            <bitfield mask="0x00004000" name="PORTD" />
            <bitfield mask="0x00008000" name="PORTD" />
         </register>
         <register caption="" name="LATA" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATA" />
            <bitfield mask="0x00000002" name="LATA" />
            <bitfield mask="0x00000004" name="LATA" />
            <bitfield mask="0x00000008" name="LATA" />
            <bitfield mask="0x00000010" name="LATA" />
            <bitfield mask="0x00000020" name="LATA" />
            <bitfield mask="0x00000040" name="LATA" />
            <bitfield mask="0x00000080" name="LATA" />
            <bitfield mask="0x00000100" name="LATA" />
            <bitfield mask="0x00000200" name="LATA" />
            <bitfield mask="0x00000400" name="LATA" />
            <bitfield mask="0x00000800" name="LATA" />
            <bitfield mask="0x00001000" name="LATA" />
            <bitfield mask="0x00002000" name="LATA" />
            <bitfield mask="0x00004000" name="LATA" />
            <bitfield mask="0x00008000" name="LATA" />
         </register>
         <register caption="" name="LATB" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATB" />
            <bitfield mask="0x00000002" name="LATB" />
            <bitfield mask="0x00000004" name="LATB" />
            <bitfield mask="0x00000008" name="LATB" />
            <bitfield mask="0x00000010" name="LATB" />
            <bitfield mask="0x00000020" name="LATB" />
            <bitfield mask="0x00000040" name="LATB" />
            <bitfield mask="0x00000080" name="LATB" />
            <bitfield mask="0x00000100" name="LATB" />
            <bitfield mask="0x00000200" name="LATB" />
            <bitfield mask="0x00000400" name="LATB" />
            <bitfield mask="0x00000800" name="LATB" />
            <bitfield mask="0x00001000" name="LATB" />
            <bitfield mask="0x00002000" name="LATB" />
            <bitfield mask="0x00004000" name="LATB" />
            <bitfield mask="0x00008000" name="LATB" />
         </register>
         <register caption="" name="LATC" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATC" />
            <bitfield mask="0x00000002" name="LATC" />
            <bitfield mask="0x00000004" name="LATC" />
            <bitfield mask="0x00000008" name="LATC" />
            <bitfield mask="0x00000010" name="LATC" />
            <bitfield mask="0x00000020" name="LATC" />
            <bitfield mask="0x00000040" name="LATC" />
            <bitfield mask="0x00000080" name="LATC" />
            <bitfield mask="0x00000100" name="LATC" />
            <bitfield mask="0x00000200" name="LATC" />
            <bitfield mask="0x00000400" name="LATC" />
            <bitfield mask="0x00000800" name="LATC" />
            <bitfield mask="0x00001000" name="LATC" />
            <bitfield mask="0x00002000" name="LATC" />
            <bitfield mask="0x00004000" name="LATC" />
            <bitfield mask="0x00008000" name="LATC" />
         </register>
         <register caption="" name="LATD" offset="0x330" rw="RW" size="4">
            <bitfield mask="0x00000001" name="LATD" />
            <bitfield mask="0x00000002" name="LATD" />
            <bitfield mask="0x00000004" name="LATD" />
            <bitfield mask="0x00000008" name="LATD" />
            <bitfield mask="0x00000010" name="LATD" />
            <bitfield mask="0x00000020" name="LATD" />
            <bitfield mask="0x00000040" name="LATD" />
            <bitfield mask="0x00000080" name="LATD" />
            <bitfield mask="0x00000100" name="LATD" />
            <bitfield mask="0x00000200" name="LATD" />
            <bitfield mask="0x00000400" name="LATD" />
            <bitfield mask="0x00000800" name="LATD" />
            <bitfield mask="0x00001000" name="LATD" />
            <bitfield mask="0x00002000" name="LATD" />
            <bitfield mask="0x00004000" name="LATD" />
            <bitfield mask="0x00008000" name="LATD" />
         </register>
