Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0256GPG048.atdf
      <value-group caption="Stop in Idle Mode bit" name="I2C2CON__SIDL">
         <value caption="Discontinue module operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue module operation in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="I2C Enable bit" name="I2C2CON__ON">
         <value caption="Enables the I2C module and configures the SDA and SCL pins as serial port pins" name="" value="0x1" />
         <value caption="Disables the I2C module; all I2C pins are controlled by PORT functions" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Hold Enable bit" name="I2C2CON__DHEN">
         <value caption="Following the 8th falling edge of SCL for a received data byte; slave hardware clears the SCKREL bit and SCL is held low" name="" value="0x1" />
         <value caption="Data holding is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Address Hold Enable bit" name="I2C2CON__AHEN">
         <value caption="Following the 8th falling edge of SCL for a matching received address byte; SCKREL bit will be cleared and the SCL will be held low." name="" value="0x1" />
         <value caption="Address holding is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Slave Mode Bus Collision Detect Enable bit" name="I2C2CON__SBCDE">
         <value caption="Enable slave bus collision interrupts" name="" value="0x1" />
         <value caption="Slave bus collision interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="SDA Hold Time Selection bit" name="I2C2CON__SDAHT">
         <value caption="Minimum of 300 ns hold time on SDA after the falling edge of SCL" name="" value="0x1" />
         <value caption="Minimum of 100 ns hold time on SDA after the falling edge of SCL" name="" value="0x0" />
      </value-group>
      <value-group caption="Buffer Overwrite Enable bit" name="I2C2CON__BOEN">
         <value caption="I2CxRCV is updated and" name="" value="0x1" />
         <value caption="I2CxRCV is only updated when the I2COV bit (I2CxSTAT) is clear" name="" value="0x0" />
      </value-group>
      <value-group caption="Start Condition Interrupt Enable bit" name="I2C2CON__SCIE">
         <value caption="Enable interrupt on detection of Start or Restart conditions" name="" value="0x1" />
         <value caption="Start detection interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop Condition Interrupt Enable bit" name="I2C2CON__PCIE">
         <value caption="Enable interrupt on detection of Stop condition" name="" value="0x1" />
         <value caption="Stop detection interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Buffer Full Status bit" name="I2C1STAT__TBF">
         <value caption="Transmit in progress" name="" value="0x1" />
         <value caption="Transmit complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Buffer Full Status bit" name="I2C1STAT__RBF">
         <value caption="Receive complete" name="" value="0x1" />
         <value caption="Receive not complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Information bit" name="I2C1STAT__R_W">
         <value caption="Read indicates data transfer is output from slave" name="" value="0x1" />
         <value caption="Write indicates data transfer is input to slave" name="" value="0x0" />
      </value-group>
      <value-group caption="Start bit" name="I2C1STAT__S">
         <value caption="Indicates that a Start (or Repeated Start) bit has been detected last" name="" value="0x1" />
         <value caption="Start bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop bit" name="I2C1STAT__P">
         <value caption="Indicates that a Stop bit has been detected last" name="" value="0x1" />
         <value caption="Stop bit was not detected last" name="" value="0x0" />
      </value-group>
      <value-group caption="Data/Address bit" name="I2C1STAT__D_A">
         <value caption="Indicates that the last byte received was data" name="" value="0x1" />
         <value caption="Indicates that the last byte received was device address" name="" value="0x0" />
      </value-group>
      <value-group caption="Receive Overflow Flag bit" name="I2C1STAT__I2COV">
         <value caption="A byte was received while the I2CxRCV register is still holding the previous byte" name="" value="0x1" />
         <value caption="No overflow" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Collision Detect bit" name="I2C1STAT__IWCOL">
         <value caption="An attempt to write the I2CxTRN register failed because the I2C module is busy" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="10-bit Address Status bit" name="I2C1STAT__ADD10">
         <value caption="10-bit address was matched" name="" value="0x1" />
         <value caption="10-bit address was not matched" name="" value="0x0" />
      </value-group>
      <value-group caption="General Call Status bit" name="I2C1STAT__GCSTAT">
         <value caption="General call address was received" name="" value="0x1" />
         <value caption="General call address was not received" name="" value="0x0" />
      </value-group>
      <value-group caption="Master Bus Collision Detect bit" name="I2C1STAT__BCL">
         <value caption="A bus collision has been detected during a master operation" name="" value="0x1" />
         <value caption="No collision" name="" value="0x0" />
      </value-group>
      <value-group caption="Acknowledge Time Status bit" name="I2C1STAT__ACKTIM">
         <value caption="I2C bus is in an Acknowledge sequence" name="" value="0x1" />
         <value caption="Not an Acknowledge sequence" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Status bit" name="I2C1STAT__TRSTAT">
         <value caption="Master transmit is in progress (8 bits + ACK)" name="" value="0x1" />
         <value caption="Master transmit is not in progress" name="" value="0x0" />
      </value-group>
