Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0256GPG048.atdf
   <module caption="" id="02819" name="NVM" version="2">
      <register-group name="NVM">
         <register caption="Flash Programming Control Register" name="NVMCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="NVM Operation bits" mask="0x0000000F" name="NVMOP" values="NVMCON__NVMOP" />
            <bitfield caption="Low-Voltage Detect Error bit" mask="0x00001000" name="LVDERR" values="NVMCON__LVDERR" />
            <bitfield caption="Write Error bit" mask="0x00002000" name="WRERR" values="NVMCON__WRERR" />
            <bitfield caption="Write Enable bit" mask="0x00004000" name="WREN" values="NVMCON__WREN" />
            <bitfield caption="Write Control bit" mask="0x00008000" name="WR" values="NVMCON__WR" />
         </register>
         <register caption="Programming Unlock Register" name="NVMKEY" offset="0x10" rw="W" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMKEY" />
         </register>
         <register caption="Flash Address Register" name="NVMADDR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMADDR" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA0" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA0" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA1" offset="0x40" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA1" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA2" offset="0x50" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA2" />
         </register>
         <register caption="Flash Data Register (x = 0-3" name="NVMDATA3" offset="0x60" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMDATA3" />
         </register>
         <register caption="Source Data Address Register" name="NVMSRCADDR" offset="0x70" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="NVMSRCADDR" />
         </register>
         <register caption="Program Flash Write-Protect Register" name="NVMPWP" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x00FFFFFF" name="PWP" />
            <bitfield caption="Program Flash Memory Page Write-protect Unlock bit" mask="0x80000000" name="PWPULOCK" values="NVMPWP__PWPULOCK" />
         </register>
         <register caption="Flash Boot (Page) Write-Protect Register" name="NVMBWP" offset="0x90" rw="RW" size="4">

            <bitfield caption="Boot Alias Page 0 Write-protect bit" mask="0x00000100" name="BWP0" values="NVMBWP__BWP0" />
            <bitfield caption="Boot Alias Page 1 Write-protect bit" mask="0x00000200" name="BWP1" values="NVMBWP__BWP1" />
            <bitfield caption="Boot Alias Page 2 Write-protect bit" mask="0x00000400" name="BWP2" values="NVMBWP__BWP2" />
            <bitfield caption="Boot Alias Page 3 Write-protect bit" mask="0x00000800" name="BWP3" values="NVMBWP__BWP3" />
            <bitfield caption="Boot Alias Page 4 Write-protect bit" mask="0x00001000" name="BWP4" values="NVMBWP__BWP4" />
            <bitfield caption="Lower Boot Alias Write-protect Unlock bit" mask="0x00008000" name="BWPULOCK" values="NVMBWP__BWPULOCK" />
         </register>
         <register caption="Flash Programming Control Register 2" name="NVMCON2" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Erase Retry Control bits" mask="0x00000300" name="ERETRY" values="NVMCON2__ERETRY" />
            <bitfield caption="Verify Read of Logic 1 Control bit" mask="0x00001000" name="VREAD1" values="NVMCON2__VREAD1" />
            <bitfield caption="Compare Read of Logic 1 bit" mask="0x00002000" name="CREAD1" values="NVMCON2__CREAD1" />
            <bitfield caption="Low-Power Read Control bit" mask="0x00008000" name="LPRD" values="NVMCON2__LPRD" />
            <bitfield caption="Wait State bits" mask="0x001F0000" name="LPRDWS" values="NVMCON2__LPRDWS" />
            <bitfield mask="0xF0000000" name="ERSCNT" />
         </register>
      </register-group>
      <value-group caption="NVM Operation bits" name="NVMCON__NVMOP">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Program erase operation: erase all of program Flash memory (all pages must be unprotected)" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Program Flash memory erase operation: erases all of Program Flash" name="" value="0x5" />
         <value caption="Page erase operation: erases page selected by NVMADDR" name="" value="0x4" />
         <value caption="Row program operation: programs row selected by NVMADDR" name="" value="0x3" />
         <value caption="Quad Word (128-bit) program operation: programs the 128-bit Flash word selected by NVMADDR" name="" value="0x2" />
         <value caption="Word program operation: programs word selected by NVMADDR" name="" value="0x1" />
         <value caption="No operation" name="" value="0x0" />
      </value-group>
      <value-group caption="Low-Voltage Detect Error bit" name="NVMCON__LVDERR">
         <value caption="Low-voltage detected (possible data corruption if WRERR is set)" name="" value="0x1" />
         <value caption="Voltage level is acceptable for programming" name="" value="0x0" />
      </value-group>
      <value-group caption="Write Error bit" name="NVMCON__WRERR">
         <value caption="Program or erase sequence did not complete successfully" name="" value="0x1" />
         <value caption="Program or erase sequence completed normally" name="" value="0x0" />
      </value-group>
