Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.4.117/atdf/PIC32MK0256GPG048.atdf
         <register caption="CACHE Miss Status Register" name="CHEMIS" offset="0x30" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="CHEMIS" />
         </register>
      </register-group>
      <value-group caption="PFM Access Time Defined in Terms of SYSCLK Wait States bits" name="CHECON__PFMWS">
         <value caption="Seven Wait states" name="" value="0x7" />
         <value caption="Six Wait states" name="" value="0x6" />
         <value caption="Five Wait states" name="" value="0x5" />
         <value caption="Four Wait states" name="" value="0x4" />
         <value caption="Three Wait states" name="" value="0x3" />
         <value caption="Two Wait states" name="" value="0x2" />
         <value caption="One Wait state" name="" value="0x1" />
         <value caption="Zero Wait states" name="" value="0x0" />
      </value-group>
      <value-group caption="Predictive Prefetch Enable bits" name="CHECON__PREFEN">
         <value caption="Enable predictive prefetch for CPU instructions only" name="" value="0x1" />
         <value caption="Disable predictive prefetch" name="" value="0x0" />
      </value-group>
      <value-group caption="PFM Address Wait State Enable bit" name="CHECON__PFMAWSEN">
         <value caption="Add one more Wait State to flash address setup (suggested for higher system clock frequencies)" name="" value="0x1" />
         <value caption="Add no Wait States to the flash address setup (suggested for lower system clock frequencies to achieve higher performance)" name="" value="0x0" />
      </value-group>
      <value-group caption="Cache Performance Counters Enable bit" name="CHECON__CHEPERFEN">
         <value caption="Performance counters are enabled" name="" value="0x1" />
         <value caption="Performance counters are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Instruction Auto-cache Coherency Control bit" name="CHECON__ICHECOH">
         <value caption="Automatically invalidate cache on a programming event" name="" value="0x1" />
         <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Auto-cache Coherency Control bit" name="CHECON__DCHECOH">
         <value caption="Automatically invalidate cache on a programming event" name="" value="0x1" />
         <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Auto-cache Coherency Control bit" name="CHECON__PERCHECOH">
         <value caption="Automatically invalidate cache on a programming event" name="" value="0x1" />
         <value caption="Do not automatically invalidate cache on a programming event" name="" value="0x0" />
      </value-group>
      <value-group caption="Instruction Cache Invalidate bit" name="CHECON__ICHEINV">
         <value caption="Force invalidate cache/invalidate busy" name="" value="0x1" />
         <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Cache Invalidate bit" name="CHECON__DCHEINV">
         <value caption="Force invalidate cache/invalidate busy" name="" value="0x1" />
         <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Cache Invalidate bit" name="CHECON__PERCHEINV">
         <value caption="Force invalidate cache/invalidate busy" name="" value="0x1" />
         <value caption="Cache Invalidation follows CHECOH/invalid complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Instruction Cache Enable bit" name="CHECON__ICHEEN">
         <value caption="Instruction cache is enabled" name="" value="0x1" />
         <value caption="Instruction cache is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Cache Enable bit" name="CHECON__DCHEEN">
         <value caption="Data cache is enabled" name="" value="0x1" />
         <value caption="Data cache is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Peripheral Cache Enable bit" name="CHECON__PERCHEEN">
         <value caption="Peripheral cache is enabled" name="" value="0x1" />
         <value caption="Peripheral cache is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01423" name="RPIN" version="">
      <register-group name="RPIN">
         <register caption="" name="INT1R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT1R" />
         </register>
         <register caption="" name="INT2R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT2R" />
         </register>
         <register caption="" name="INT3R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT3R" />
         </register>
         <register caption="" name="INT4R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INT4R" />
         </register>
         <register caption="" name="T2CKR" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T2CKR" />
         </register>
         <register caption="" name="T3CKR" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T3CKR" />
         </register>
         <register caption="" name="T4CKR" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T4CKR" />
         </register>
         <register caption="" name="T5CKR" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T5CKR" />
         </register>
         <register caption="" name="T6CKR" offset="0x24" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T6CKR" />
         </register>
         <register caption="" name="T7CKR" offset="0x28" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T7CKR" />
         </register>
         <register caption="" name="T8CKR" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T8CKR" />
         </register>
         <register caption="" name="T9CKR" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="T9CKR" />
         </register>
